src/testsuite_old/sysbench/results/oltp_update_index.lua_threads64/run.perf.log
sysbench 1.1.0 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 64
Warmup time: 10s
Report intermediate results every 20 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

Warming up for 10 seconds...

[ 20s ] thds: 64 tps: 257.67 qps: 257.67 (r/w/o: 0.00/257.67/0.00) lat (ms,95%): 419.45 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 64 tps: 272.25 qps: 272.25 (r/w/o: 0.00/272.25/0.00) lat (ms,95%): 404.61 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 64 tps: 402.60 qps: 402.60 (r/w/o: 0.00/402.60/0.00) lat (ms,95%): 257.95 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           18519
        other:                           0
        total:                           18519
    transactions:                        18519  (307.28 per sec.)
    queries:                             18519  (307.28 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      307.2757
    time elapsed:                        60.2693s
    total number of events:              18519

Latency (ms):
         min:                                   67.72
         avg:                                  208.71
         max:                                  857.88
         95th percentile:                      383.33
         sum:                              3865186.20

Threads fairness:
    events (avg/stddev):           289.3594/2.03
    execution time (avg/stddev):   60.3935/0.01

sysbench 1.1.0 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 64
Warmup time: 10s
Report intermediate results every 20 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

Warming up for 10 seconds...

[ 20s ] thds: 64 tps: 425.49 qps: 425.49 (r/w/o: 0.00/425.49/0.00) lat (ms,95%): 200.47 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 64 tps: 418.95 qps: 418.95 (r/w/o: 0.00/418.95/0.00) lat (ms,95%): 207.82 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 64 tps: 451.00 qps: 451.00 (r/w/o: 0.00/451.00/0.00) lat (ms,95%): 193.38 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           25848
        other:                           0
        total:                           25848
    transactions:                        25848  (430.21 per sec.)
    queries:                             25848  (430.21 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      430.2144
    time elapsed:                        60.0824s
    total number of events:              25848

Latency (ms):
         min:                                   59.32
         avg:                                  149.02
         max:                                  617.28
         95th percentile:                      200.47
         sum:                              3851785.29

Threads fairness:
    events (avg/stddev):           403.8750/3.20
    execution time (avg/stddev):   60.1841/0.01